app/Controllers/C_admin_page.php

SELECT *
FROM `textos`
---
    public function adminPage(){
        $segmentos = $this->uri->getSegments();
        $model=new M_textos();
        $home=$model->findAll();