app/Controllers/C_config.php

    public function editarNav(){

        $db = Config::connect();
        $builder = $db->table('menu A');
        // Hacer la unión y seleccionar las columnas requeridas
        $builder->join(  'submenu B', 'A.id = B.created_by', 'right');
        $builder->select('A.id, B.id_sub, A.nombre, B.submenu, B.slug, B.opcion');

        $results = $builder->get()->getResult();

        $segmentos = $this->uri->getSegments();
        $modelNav=new M_menu();
        $send=$modelNav->findAll();

         $segmentos = $this->uri->getSegments();
          $url=$segmentos[0];

        $datosNav=['datosNav'=>$this->session->get(),
                                  "nav"=>$results,
                                 "menu"=> $send,
                                 "url"=>$url];

        $footer=new M_footer();
        $footerdata['datosfooter']=$footer->findAll();
---
SELECT `A`.`id`, `B`.`id_sub`, `A`.`nombre`, `B`.`submenu`, `B`.`slug`, `B`.`opcion`
FROM `menu` `A`
RIGHT JOIN `submenu` `B` ON `A`.`id` = `B`.`created_by`
SELECT *
FROM `menu`
SELECT *
FROM `footer`