app/Controllers/C_dinamic2.php

SELECT `A`.`id`, `B`.`id_sub`, `A`.`nombre`, `B`.`submenu`, `B`.`slug`, `B`.`opcion`, `B`.`created_by`
FROM `menu` `A`
RIGHT JOIN `submenu` `B` ON `A`.`id` = `B`.`created_by`
SELECT `B`.`titulo`, `B`.`texto`, `B`.`url`, `A`.`submenu`, `A`.`slug`, `B`.`id_textos`
FROM `submenu` `A`
RIGHT JOIN `textos` `B` ON `A`.`id_sub` = `B`.`text_by`
SELECT *
FROM `menu`
---
    public function show($slug)
    {



        $db = Config::connect();
        $builder = $db->table('menu A');
        // Hacer la unión y seleccionar las columnas requeridas
        $builder->join(  'submenu B', 'A.id = B.created_by', 'right');
        $builder->select('A.id, B.id_sub, A.nombre, B.submenu, B.slug, B.opcion, B.created_by');

        $results = $builder->get()->getResult();



        $dbTexto = Config::connect();
        $builderText = $db->table('submenu A');
        // Hacer la unión y seleccionar las columnas requeridas
        $builderText->join(  'textos B', 'A.id_sub = B.text_by', 'right');
        $builderText->select('B.titulo, B.texto, B.url, A.submenu, A.slug, B.id_textos');

        $resultsText = $builderText->get()->getResult();

        $modelNav=new M_menu();
        $send=$modelNav->findAll();