app/Controllers/c_nav.php

INSERT INTO `menu` (`nombre`) VALUES ('postgrados')
INSERT INTO `submenu` (`submenu`, `created_by`, `slug`) VALUES ('postgrados', 55, 'postgrados')
---
    public function navE(){
        $menu= $this->request->getVar('menu');
        $modelNav=new M_menu();
        $submenu=new M_submenu();
        if($menu != ''){
            $ultimoInsertado=$modelNav->insert(['nombre'=>$menu]);
        $submenu->insert(['submenu' => $menu, 'created_by' => $ultimoInsertado, 'slug' => $menu]);