app/Controllers/Home.php

SELECT `A`.`id`, `B`.`id_sub`, `A`.`nombre`, `B`.`submenu`, `B`.`slug`, `B`.`opcion`, `B`.`created_by`
FROM `menu` `A`
RIGHT JOIN `submenu` `B` ON `A`.`id` = `B`.`created_by`
SELECT *
FROM `textos`
SELECT *
FROM `menu`
SELECT `B`.`titulo`, `B`.`texto`, `B`.`url`, `A`.`submenu`, `A`.`slug`, `B`.`id_textos`, `A`.`id_sub`, `A`.`opcion`, `A`.`created_by`
FROM `submenu` `A`
RIGHT JOIN `textos` `B` ON `A`.`id_sub` = `B`.`text_by`
SELECT *
FROM `inicio`
---
    public function index()
    {

      $db = Config::connect();
      $builder = $db->table('menu A');
      // Hacer la unión y seleccionar las columnas requeridas
      $builder->join(  'submenu B', 'A.id = B.created_by', 'right');
      $builder->select('A.id, B.id_sub, A.nombre, B.submenu, B.slug , B.opcion, B.created_by');

      $results = $builder->get()->getResult();

      $dbTexto = Config::connect();
      $builderText = $db->table('submenu A');
      // Hacer la unión y seleccionar las columnas requeridas
      $builderText->join(  'textos B', 'A.id_sub = B.text_by', 'right');
      $builderText->select('B.titulo, B.texto, B.url, A.submenu, A.slug, B.id_textos,A.id_sub, A.opcion,  A.created_by');

      $resultsText = $builderText->get()->getResult();



      $segmentos = $this->uri->getSegments();
      $modelNav=new M_menu();
      $send=$modelNav->findAll();
      $datos=['datosNav'=>$this->session->get(),
                          "nav"=>$results,
                         "menu"=> $send,
                         "nav2"=>$resultsText];

      $inicio=new M_inicio();
      $inicioAll=$inicio->findAll();

SELECT *
FROM `footer`
---


      $footer=new M_footer();
      $footerdata['datosfooter']=$footer->findAll();